In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
# Load in the data
df_cleveland = pd.read_csv("/Users/mani/Desktop/heart-disease-predictor/data/processed.cleveland.data", header=None)
df_hungary = pd.read_csv("/Users/mani/Desktop/heart-disease-predictor/data/processed.hungarian.data", header=None)
df_switzerland = pd.read_csv("/Users/mani/Desktop/heart-disease-predictor/data/processed.switzerland.data", header=None)
df_va = pd.read_csv("/Users/mani/Desktop/heart-disease-predictor/data/processed.va.data", header=None)

In [14]:
df_cleveland.head()

     0    1    2      3      4    5    6      7    8    9    10   11   12  13
0  63.0  1.0  1.0  145.0  233.0  1.0  2.0  150.0  0.0  2.3  3.0  0.0  6.0   0
1  67.0  1.0  4.0  160.0  286.0  0.0  2.0  108.0  1.0  1.5  2.0  3.0  3.0   2
2  67.0  1.0  4.0  120.0  229.0  0.0  2.0  129.0  1.0  2.6  2.0  2.0  7.0   1
3  37.0  1.0  3.0  130.0  250.0  0.0  0.0  187.0  0.0  3.5  3.0  0.0  3.0   0
4  41.0  0.0  2.0  130.0  204.0  0.0  2.0  172.0  0.0  1.4  1.0  0.0  3.0   0

In [16]:
def change_column_names(df):
    """
    Changes the column names to the ones specified on the UCI website
    param df: A dataframe with columns
    return: A dataframe with transformed column names
    """
    df.columns = ["age", "sex", "cp", "trest", "chol", "fbs", "restecg",
                "thalach", "exang", "oldpeak", "slope", "ca", "thal", "num"]
    return df

In [19]:
# Using the function to change the column names

df_cleveland = change_column_names(df_cleveland)

In [20]:
df_cleveland.head()

,age,sex,cp,trest,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,63.0,1.0,1.0,145.0,233.0,1.0,2.0,150.0,0.0,2.3,3.0,0.0,6.0,0
1,67.0,1.0,4.0,160.0,286.0,0.0,2.0,108.0,1.0,1.5,2.0,3.0,3.0,2
2,67.0,1.0,4.0,120.0,229.0,0.0,2.0,129.0,1.0,2.6,2.0,2.0,7.0,1
3,37.0,1.0,3.0,130.0,250.0,0.0,0.0,187.0,0.0,3.5,3.0,0.0,3.0,0
4,41.0,0.0,2.0,130.0,204.0,0.0,2.0,172.0,0.0,1.4,1.0,0.0,3.0,0

In [21]:
# Changing the names of the columns for the other dataframes
df_hungary = change_column_names(df_hungary)
df_switzerland = change_column_names(df_switzerland)
df_va = change_column_names(df_va)

In [22]:
df_cleveland.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age        303 non-null float64
sex        303 non-null float64
cp         303 non-null float64
trest      303 non-null float64
chol       303 non-null float64
fbs        303 non-null float64
restecg    303 non-null float64
thalach    303 non-null float64
exang      303 non-null float64
oldpeak    303 non-null float64
slope      303 non-null float64
ca         303 non-null object
thal       303 non-null object
num        303 non-null int64
dtypes: float64(11), int64(1), object(2)
memory usage: 33.3+ KB

In [25]:
df_hungary.head()

,age,sex,cp,trest,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,28,1,2,130,132,0,2,185,0,0.0,?,?,?,0
1,29,1,2,120,243,0,0,160,0,0.0,?,?,?,0
2,29,1,2,140,?,0,0,170,0,0.0,?,?,?,0
3,30,0,1,170,237,0,1,170,0,0.0,?,?,6,0
4,31,0,2,100,219,0,1,150,0,0.0,?,?,?,0

In [23]:
df_hungary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 294 entries, 0 to 293
Data columns (total 14 columns):
age        294 non-null int64
sex        294 non-null int64
cp         294 non-null int64
trest      294 non-null object
chol       294 non-null object
fbs        294 non-null object
restecg    294 non-null object
thalach    294 non-null object
exang      294 non-null object
oldpeak    294 non-null float64
slope      294 non-null object
ca         294 non-null object
thal       294 non-null object
num        294 non-null int64
dtypes: float64(1), int64(4), object(9)
memory usage: 32.3+ KB

In [26]:
df_switzerland.head()

,age,sex,cp,trest,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,32,1,1,95,0,?,0,127,0,.7,1,?,?,1
1,34,1,4,115,0,?,?,154,0,.2,1,?,?,1
2,35,1,4,?,0,?,0,130,1,?,?,?,7,3
3,36,1,4,110,0,?,0,125,1,1,2,?,6,1
4,38,0,4,105,0,?,0,166,0,2.8,1,?,?,2

In [27]:
df_switzerland.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 123 entries, 0 to 122
Data columns (total 14 columns):
age        123 non-null int64
sex        123 non-null int64
cp         123 non-null int64
trest      123 non-null object
chol       123 non-null int64
fbs        123 non-null object
restecg    123 non-null object
thalach    123 non-null object
exang      123 non-null object
oldpeak    123 non-null object
slope      123 non-null object
ca         123 non-null object
thal       123 non-null object
num        123 non-null int64
dtypes: int64(5), object(9)
memory usage: 13.6+ KB

In [28]:
df_va.head()

,age,sex,cp,trest,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,63,1,4,140,260,0,1,112,1,3,2,?,?,2
1,44,1,4,130,209,0,1,127,0,0,?,?,?,0
2,60,1,4,132,218,0,1,140,1,1.5,3,?,?,2
3,55,1,4,142,228,0,1,149,1,2.5,1,?,?,1
4,66,1,3,110,213,1,2,99,1,1.3,2,?,?,0

In [29]:
df_va.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 14 columns):
age        200 non-null int64
sex        200 non-null int64
cp         200 non-null int64
trest      200 non-null object
chol       200 non-null object
fbs        200 non-null object
restecg    200 non-null int64
thalach    200 non-null object
exang      200 non-null object
oldpeak    200 non-null object
slope      200 non-null object
ca         200 non-null object
thal       200 non-null object
num        200 non-null int64
dtypes: int64(5), object(9)
memory usage: 22.0+ KB